app/controllers/bookings_controller.rb

INSERT INTO `bookings` (`user_id`, `ride_id`, `noofseats`, `totalcost`, `created_at`, `updated_at`) VALUES(1, NULL, NULL, NULL, '2014-07-30 10:48:26', '2014-07-30 10:48:26')
---
	def create
		@booking = current_user.bookings.build(params[:booking])
		if @booking.save

SELECT * FROM `bookings` WHERE (`bookings`.user_id = 4)
SELECT * FROM `rides` WHERE (`rides`.`id` IN (7,8))
---
	def index
		@bookings = current_user.bookings.find(:all, :include => [:ride])