app/controllers/cars_controller.rb

	def create
		@car = current_user.cars.build(params[:car])
		if @car.save
---
INSERT INTO `cars` (`user_id`, `seats`, `created_at`, `updated_at`, `typeofcar`) VALUES(2, 5, '2014-07-29 08:59:41', '2014-07-29 08:59:41', NULL)

	def update

    	if @car.update_attributes(params[:car])
---
UPDATE `cars` SET `typeofcar` = 'Audi S4', `updated_at` = '2014-08-06 10:22:59' WHERE `id` = 10

	def destroy
		if Car.destroy(params[:id])
---
DELETE FROM `cars` WHERE `id` = 4

    def find_car

    		@car = Car.find(params[:id])
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 4)