app/controllers/rides_controller.rb

def create

	@ride = current_user.rides.build(params[:ride])
	if @ride.save
---
INSERT INTO `rides` (`user_id`, `car_id`, `from`, `to`, `date`, `created_at`, `updated_at`, `cost`, `seats_available`, `status`) VALUES(2, 2, 'Chennai, Tamil Nadu, India', 'Trichy, Tamil Nadu, India', '2014-08-09', '2014-08-07 12:59:07', '2014-08-07 12:59:07', 300, 2, NULL)

def index
	@rides = current_user.rides.find(:all, :include => [:car],:order =>  "status DESC")
---
SELECT * FROM `cars` WHERE (`cars`.`id` IN (3,8,2))
SELECT * FROM `rides` WHERE (seats_available > 0) AND (`rides`.user_id = 4)

def update


    if @ride.update_attributes(params[:ride])
---
UPDATE `rides` SET `date` = NULL, `car_id` = 8, `cost` = 1000, `updated_at` = '2014-08-07 04:46:50' WHERE `id` = 6

def destroy



		if @ride.update_attributes(:status => 0 )
---
UPDATE `rides` SET `status` = 0, `updated_at` = '2014-08-07 10:51:58' WHERE `id` = 1

def index_for_booking

	@booking = Booking.new
	@rides = Ride.all(:conditions =>['seats_available > ? AND `date` = ? AND `status` = ?', 0, DateTime.now,1 ])
---
SELECT * FROM `rides` WHERE (seats_available > 0 AND `date` >= '2014-08-04 11:50:09')

def find_ride
	@ride = Ride.find(params[:id])
---
SELECT * FROM `rides` WHERE (`rides`.`id` = 2)