app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `crypted_password`, `password_salt`, `email`, `persistence_token`, `single_access_token`, `perishable_token`, `login_count`, `failed_login_count`, `last_request_at`, `current_login_at`, `last_login_at`, `current_login_ip`, `last_login_ip`, `created_at`, `updated_at`, `description`) VALUES('Manoj', '81fc3e6ec074e34ffb3cfc01af5a3adb0d34235f25085bd3bff472c1708c34279bc812e699ca279d42fdfcaf014d39989158d0d3c77b105b098a728fe3423d73', 'CSbPKkvw3wUOHWcfENP', 'manojmj921@gmail.com', '24ca87738b93d59a620b3773f9c8a93a1f62d150684c97d8c6cce7ef1e591fbc4e4e9f43c2845878706620c162b1a04c5599ddd99057b7b044a8789e7e68b0fd', 'flQuwqeClpwtE4vIvXLv', 'OyxvCvITJH61aEwlzi6', 1, 0, '2014-07-29 06:45:05', '2014-07-29 06:45:05', NULL, '127.0.0.1', NULL, '2014-07-29 06:45:05', '2014-07-29 06:45:05', 'Mydesc')
---
  def create
    @user = User.new(params[:user])

    if @user.save

UPDATE `users` SET `name` = 'Manoj M J', `password_salt` = 'A1Wj3rD2JzKEgak6i8GD', `crypted_password` = '421c6928f99ee5a656ef0104fae6c9bd9ed2a2d194844e46f3d88a3ddc57513b133e63bb9c371e004311c2b73fb79e17451761707d0a762d5e27453099d267ab', `persistence_token` = '708cb24b3c4632b227954431dcd064e570a703fd804eda949664d947bb5cfb1e90ffe197c8fd885b99c7fbdd2a512bdd4a17e49ba799128c696d9183cc25d7f9', `description` = 'hello world', `perishable_token` = 'JYBtOaqVT70YY65zNxde', `last_request_at` = '2014-08-05 07:27:21', `login_count` = 46, `last_login_at` = '2014-08-05 07:08:40', `current_login_at` = '2014-08-05 07:27:21', `updated_at` = '2014-08-05 07:27:21' WHERE `id` = 2
---
  def update

    if @user.update_attributes(params[:user])